study-plan
第一周（1.28-1.31号）

任务一：梳理《精通css》，每天两章并总结重要知识点

任务二：逛一小时社区，看博客（每天至少1小时）

时间　　　　　　　　　　　 　读书笔记　　　　　　　　　　　　　　　 

2016.1.28　　　　　　《精通css》第三章可视化格式模型和第四章背景图像效果　　　　　　

2016.1.29　　　　　　《精通css》第六章对列表应用样式和创建导航和第七章对表单和数据表格应用样式　　　　　　 

2016.1.30　　　　　　《精通css》第八章布局和第九章bug和修复bug　　　 

2016.1.31　　　　　　《精通css》实例研究　练习html和css　　 　　 

第二周（2.1-2.7号）

任务一：梳理《JavaScript权威指南》，每天两章并总结重要知识点

任务二：逛社区，看博客（每天至少1小时）

时间　　　　　　　　　　　 　读书笔记　　　　　　　　　　　　　　　 　　　　　　　　　　

2016.2.1　　　　　　《js权威指南》第2章词法结构和第3章类型、值和变量
　　　　　　　　　　 　　
2016.2.2　　　　　　《js权威指南》第4章表达式和运算符和第5章语句

2016.2.3　　　　　　《js权威指南》第6章对象和第7章数组

2016.2.4　　　　　　《js权威指南》第8章函数和第9章类和模块　　　　　　　　　 　　

2016.2.5　　　　　　《js权威指南》第10章正则表达式的模式匹配和第11章JavaScript的子集和扩展　

2016.2.6　　　　　　《js权威指南》第12章服务器端JavaScript和第13章 Web浏览器中的JavaScript

2016.2.7　　　　　　《js权威指南》第14章Window对象和第15章脚本化文档

博客阅读

一周推荐文章阅读总结
